[
    {
        "Category": "Информац. безопасность",
        "Title": "Свободное программное обеспечение. браузеры",
        "Article_link": "https://codeby.net/threads/svobodnoe-programmnoe-obespechenie-brauzery.81743/",
        "Author": "D3L1F3R",
        "Author_link": "https://codeby.net/members/d3l1f3r.237099/",
        "Text": " В современном мире, мы практически не обходимся без такой штуки как веб-браузер. Благодаря нему, мы попадаем в некий виртуальный мир, в котором свои законы и нормы. Для таких целей в основном используют «Яндекс», «Chrome», «Opera», «Firefox» и другие. Как вы думаете, безопасны ли они? Можно ли им доверять? Как никак вы даёте им ПРАВО знать ваши пароли, номера банковских карт, ключевые слова, историю поиска.Да, на такое можно закрыть глаза, статистика и прочие сказки. Но на самом деле, мы точно не знаем, а браузер точно собирает перечисленное выше или... В этом и есть опасность закрытого кода, неизвестность. Возможно прямо сейчас ваш браузер прослушивает вас, с того момента когда вы разрешили приложению доступ к микрофону, если не с самого момента установки. Про камеру и телеметрию и говорить не стоит, они 100% включены и корпорации не постыдятся этим воспользоваться, например - продать. Меня просто разрывает злость и агрессия, когда за мной следят, пытаются использовать информацию обо мне, а уж тем более продать.Как например это было с Яндексом, да я понимаю что информацию не продали(не факт), а слили, но тогда пользоваться проприетарными программами ещё опаснее...\tСсылка скрыта от гостей«Среди прочего, в обнародованной базе данных указываются адрес клиента, номер телефона, используемое устройство для оформления заказов и сумма, потраченная за полгода. Проверка DTF показала, что информация верна. Создатели сервиса также подготовили форму, которая позволяет проверить наличие в базе данных по номеру телефона или ФИО.»Вводимый вам адрес дома, номер телефона и т.д в приложения для покупки еды, теперь лежит в небезопасных руках. К тому же вопрос, зачем корпорации на постоянном хранении эта информация? Почему после оформления заказа и успешной доставки, она не уничтожается навсегда? Скорее всего, эта информация уже ушла каким-нибудь ребятам, что звонят в середине дня и говорят «Добрый день, меня зовут Аркадий, хотел бы вам втюхать....». А что если это несёт больший посыл? Как в меме «Буквально 1984», да я про Тотальный контроль, мир угнетённых, мир рабов. Капиталистическая система будет эксплуатировать нас, а мы и сделать ничего не сможем. Именно поэтому ВАЖНО знать цену своей информации, и права корпораций.Как сократить обьём получаемых данных?Использовать свободный, открытый браузер сделанный такими же рабочими, как и ты.Вот некоторые из них:1.LibreWolfЭтот проект представляет собой пользовательскую и независимую версию Firefox, основными целями которой являются конфиденциальность, безопасность и свобода пользователей.LibreWolf разработан для повышения защиты от методов отслеживания и снятия отпечатков пальцев, а также включает несколько улучшений безопасности. Это достигается с помощью наших настроек и исправлений, ориентированных на конфиденциальность и безопасность. LibreWolf также стремится удалить всю телеметрию, сбор данных и раздражающие факторы, а также отключить функции против свободы, такие как DRM.Ссылка на сайт: \t\tСсылка скрыта от гостейДля пользователей Arch-линукс или Manjaro: \t\tСсылка скрыта от гостей2. FirefoxFirefox — это бесплатный веб-браузер с открытым исходным кодом, разработанный Mozilla Foundation и его дочерней компанией Mozilla Corporation.Ссылка на сайт: \t\tСсылка скрыта от гостей3.IceCatGNU IceCat — это GNU-версия браузера Firefox. Его главное преимущество — этическое: это полностью бесплатное программное обеспечение. Хотя исходный код Firefox из проекта Mozilla является бесплатным программным обеспечением, они распространяют и рекомендуют несвободное программное обеспечение в виде подключаемых модулей и дополнений. Также их лицензия на товарный знак накладывает требования на распространение модифицированных версий, что делает неудобным осуществление свободы 3.Ссылка на сайт: \t\tСсылка скрыта от гостей4.ChromiumChromium — это бесплатный проект веб-браузера с открытым исходным кодом, в основном разработанный и поддерживаемый Google. Эта кодовая база содержит большую часть кода для браузера Google Chrome, который является проприетарным программным обеспечением и имеет некоторые дополнительные функции.(я таким не стал бы пользоваться, но вроде как обещают открытость)Это были 3 основных браузера, которыми желательно пользоваться и отказаться от Google или Яндекс, очевидно, что браузеры нуждаются в доп.настройке.Найстрока браузеров.1. В настройках, в разделе Куки и данные - ставим галочку \"удалять при закрытии\"2. Отключаем сохранение паролей, и запросы на их сохранение.3. Ставим единственный и основной поисковик DuckDuckGo4. Далее идём в about:config и отключаем следующее\t\t\tbrowser.safebrowsingtoolkit.telemetrydom.event.clipboardevents.enablednetwork.prefetch-next\t\tНажмите, чтобы раскрыть...5. Удаляем из меню конфигов все ссылки связаные с Google или Яндекс и т.п (ВАЖНО! не удаляйте goog-строчки, они очень важны.)НЕЛЬЗЯ УДАЛЯТЬ!!!6. Ну а далее устанавилваем расширения\tСсылка скрыта от гостей - Блокировщик рекламы\tСсылка скрыта от гостей - подмена пользователя (браузера, устройства)HTTPS everywhere - успешное соединение только по HTTPS протоколу\tСсылка скрыта от гостей - Отключение всех скриптов и/или нежелательных на любом сайте\tСсылка скрыта от гостей- Расширение балансирует подход к конфиденциальности в Интернете между потребителями и поставщиками контента путем блокировки рекламы и отслеживания файлов cookie, которые не соблюдают настройку «Не отслеживать» в веб-браузере пользователя.\t\tСсылка скрыта от гостейCanvas Defender - Вместо того, чтобы полностью блокировать отпечатки пальцев холста, надстройка Canvas Defender создает уникальный и постоянный шум, который скрывает ваш настоящий отпечаток пальца холста.\t\tНажмите, чтобы раскрыть...Больше по теме здесь: Заметка - Полная анонимность или Свобода требует жертв",
        "Date": 